/**
 * Created by dell on 2016/7/8.
 */
var customer = customer || {};

customer.wu = {
    initDetail: function(){
        var data_minsheng = [{
            "id": 1,
            "title": "乐民生-促和谐 提供快乐的民生保障，促进社区的和谐稳定",
            "img1": "",
            "text1": "2月13日，禾盛社区居委会、社区计生协、妇联在水晶森林广场举办“美丽厦门共同缔造”全家总动员“晒元宵”比赛，居民们一起过元宵节，大家围在桌子前，揉面、放馅、揉团⋯⋯伴随着欢声笑语，一个个香气四溢、寓意团圆的汤圆揉出了浓浓的团圆年味儿。",
            "img2": "./../../images/hudong/wu/wu-1-1.jpg",
            "text2": "2月23日，由禾盛社区承办的湖里区春节企业用工招聘会暨禾山街道用工服务周圆满结束。此次活动吸引了辖区内外86家企业参加，提供的岗位数达397个，初步达成意向580人左右，有效缓解了部分企业的用工需求。",
            "img3": "./../../images/hudong/wu/wu-1-2.jpg",
            "text3": "",
            "name": "",
            "time": ""
        },{
            "id": 2,
            "title": "",
            "img1": "",
            "text1": "2月23日，由禾盛社区承办的湖里区春节企业用工招聘会暨禾山街道用工服务周圆满结束。此次活动吸引了辖区内外86家企业参加，提供的岗位数达397个，初步达成意向580人左右，有效缓解了部分企业的用工需求。",
            "img2": "./../../images/hudong/wu/wu-1-3.jpg",
            "text2": "3月29日上午，区委组织部部长林重阳以一名普通党员身份来到禾盛社区，带着他为王阿婆精心挑选的新电风扇在社区书记林军链的陪同下，亲临王阿婆家开展“圆心愿”活动，并详细了解老人和重病卧床儿子的生活情况，嘱咐老人有困难时一定要找社区反映，联建支部和在职党员会尽力帮忙解决。",
            "img3": "./../../images/hudong/wu/wu-1-4.jpg",
            "text3": "",
            "name": "",
            "time": ""
        }];
        var data_fuwu = [{
            "id": 1,
            "title": "乐服务—促发展 提倡快乐的服务精神，促进社区稳步发展”",
            "img1": "",
            "text1": "1月11日，禾盛社区举办“情暖禾山，便民服务下基层”活动，现场有义务理发、送春联、家电维修、缝纫等形式多样志愿服务服务活动，得到了广大社区居民交口称赞。",
            "img2": "./../../images/hudong/wu/wu-2-1.jpg",
            "text2": "“美丽厦门，共同缔造”从美丽小区开始，继禹州香槟城、碧湖嘉园、书香佳缘“美丽小区”督导队之后，古龙居住公园成立了第四支“美丽小区”督导队。",
            "img3": "./../../images/hudong/wu/wu-2-2.jpg",
            "text3": "3月5日，社区组织志愿者与工作人员慰问困难老人和高龄老人活动，给老人送去了油、大米、木耳、粉丝等慰问品，用实际行动表达对老年人的关心和关怀。",
            "name": "",
            "time": ""
        },{
            "id": 2,
            "title": "",
            "img1": "",
            "text1": "",
            "img2": "./../../images/hudong/wu/wu-2-3.jpg",
            "text2": "3月29日，禾盛社区居委会举办健康服务进社区义诊活动，此次义诊活动，涵盖了看病、量血压、卫生防疫等多项内容，吸引了小区内近百名居民参与，特别是一些行动不便的老人解决了“看病难”问题。",
            "img3": "./../../images/hudong/wu/wu-2-4.jpg",
            "text3": "",
            "name": "",
            "time": ""
        }];
        var data_zuzhi = [{
            "id": 1,
            "title": "乐组织-增魅力 打造一个快乐的组织，增加社区组织魅力",
            "img1": "",
            "text1": "3月，结合党的群众路线教育实践活动，禾盛社区开展了 “征集微心愿•实现微梦想”为主题的“美丽微心愿”征集活动，重点帮助社区困难党员群众、空巢老人、残疾人等弱势群体,实现“微心愿”, 帮助他们解决实际困难。",
            "img2": "./../../images/hudong/wu/wu-3-1.jpg",
            "text2": "3月9日，禾盛社区开展“在职党员进社区12371工程”活动，湖里区委组织部部长林重阳、副部长黄双凤带领党支部成员来到社区报到，并认真听取了关于开展群众路线教育实践活动的工作汇报，当场认领了四张群众“美丽心愿卡”，成员们纷纷签下了承诺书。随后黄双凤副部长代表区委组织部党支部与社区签订了“党支部联建协议”。",
            "img3": "./../../images/hudong/wu/wu-3-2.jpg",
            "text3": "",
            "name": "",
            "time": ""
        },{
            "id": 2,
            "title": "",
            "img1": "",
            "text1": "3月25日，禾盛社区召开“两违”工作部署会。林军链书记首先传达街道相关文件精神。其次做了重要部署：一要抓好宣传工作，对打击“两违”工作的法律法规、政策进行宣传和教育；二要明确责任到位，以街道会议布置的责任抓好落实；三要加大巡逻力度，加大密度，坚决不留死角。",
            "img2": "./../../images/hudong/wu/wu-3-3.jpg",
            "text2": "4月12日，区委组织部、禾山街道的党员干部将在社区网格员的带领下开展“进百家门、见百家人、聊百家事、解百家难”走家入户活动，倾听群众心声，全面了解社情民意。区街干部深入20多户居民家中与居民谈心，发放联系卡，认真撰写民情日记，填写家庭情况调查表，广泛征求党员和群众意见。此次走访，社区共征求群众意见20条，党员意见建议3条。",
            "img3": "./../../images/hudong/wu/wu-3-4.jpg",
            "text3": "",
            "name": "",
            "time": ""
        }];
        var data_wenhua = [{
            "id": 1,
            "title": "乐文化—添动力 倡导快乐的文化理念，增添社区欢乐色彩",
            "img1": "",
            "text1": "1月5日，禾盛社区举办第三届全国网络春晚禾盛专场暨‘我们都是一家人’流动人口返乡宣传”活动，来社区各行各业的300多名志愿者载歌载舞，为流动人口带来了归属感。",
            "img2": "./../../images/hudong/wu/wu-4-1.jpg",
            "text2": "2月15日，禾盛社区组织馨雅艺术团团员、计生协会会员、老人协会代表、工会成员到集美双龙潭开展元宵健步行活动。",
            "img3": "./../../images/hudong/wu/wu-4-2.jpg",
            "text3": "",
            "name": "",
            "time": ""
        },{
            "id": 2,
            "title": "",
            "img1": "",
            "text1": "3月8日，禾盛社区承办的“美丽厦门共同缔造平安建设伴你同行”湖里区综治宣传月启动仪式在五缘湾乐都汇购物广场举行。台上精彩纷呈的文艺表演吸引了台下群众的目光，当中穿插的创建“平安家庭”有奖知识问答更是吸引了现场群众的广泛参与。",
            "img2": "./../../images/hudong/wu/wu-4-3.jpg",
            "text2": "4月8日，澳大利亚阳光海岸市珍尼.麦凯议员一行人再次来到我社区参访，二十余名热心的社区志愿者为外国友人展示了中国传统文化，一场福、禄、寿“三星报喜”的表演拉开了中外文化交流的序幕，现场还有古筝、太极剑表演、茶艺展示、包饺子、书法志愿现场创作赠送外国友人书画作品等活动。澳大利亚阳光海岸市议员一行邀请中国老妈妈到澳大利亚去参观交流。",
            "img3": "./../../images/hudong/wu/wu-4-4.jpg",
            "text3": "",
            "name": "",
            "time": ""
        }];
        var data_chengzhang = [{
            "id": 1,
            "title": "乐成长-提素质 营造快乐的成长氛围，提供社区居民素质",
            "img1": "",
            "text1": " 1月13日，禾盛社区组织冬令营之“巧手搭建美丽禾盛”建筑模型在古龙居住公园文化长廊内举行。此次比赛共有51名青少年参加，意在提高青少年的创新精神、动手能力及科技素质。",
            "img2": "./../../images/hudong/wu/wu-5-1.jpg",
            "text2": "1月14日，禾盛社区组织冬令营小营员参观惠和石文化园。小营员们除了享受到一场石头的视觉盛宴，还可以深切感受到闽南文化的深邃魅力以及惠女独特民俗风情。",
            "img3": "./../../images/hudong/wu/wu-5-2.jpg",
            "text3": "",
            "name": "",
            "time": ""
        },{
            "id": 2,
            "title": "",
            "img1": "",
            "text1": "3月5日下午，社区在碧湖家园的老年活动中心开展了红十字现场救护培训，培训的内容包括：对现代救护的认识与特点、黄金救护时间、现场救援的步骤与原则、常见急症的救护。",
            "img2": "./../../images/hudong/wu/wu-5-3.jpg",
            "text2": "3月23日，禾盛社区在水晶森林广场举办健身气功•马王堆导引术培训班。此次社区特邀国家一级体育指导员林绍谈老师亲临教学，来自多个小区40多名爱好者汇聚一堂。",
            "img3": "./../../images/hudong/wu/wu-5-4.jpg",
            "text3": "",
            "name": "",
            "time": ""
        }];
        var type = Util.common.getParameter('id');
        if(type == 1) {
            Util.common.loadTemplate("#wu-detail", "#wu-detail-t", data_minsheng);
        } else if(type == 2) {
            Util.common.loadTemplate("#wu-detail", "#wu-detail-t", data_fuwu);
        } else if(type == 3) {
            Util.common.loadTemplate("#wu-detail", "#wu-detail-t", data_zuzhi);
        } else if(type == 4) {
            Util.common.loadTemplate("#wu-detail", "#wu-detail-t", data_wenhua);
        } else if(type == 5) {
            Util.common.loadTemplate("#wu-detail", "#wu-detail-t", data_chengzhang);
        }
        $('.pp-item .pp-icon:nth-of-type(1)').remove();
        $('.pp-item .detail-desc:nth-of-type(1)').css("margin-top", "4%");
        $('.detail-desc-text').css('border-bottom', 'none');
    }
};
